{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional_6",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "inputShape": [27],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_6"
            },
            "name": "input_layer_6",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_18",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {}
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            },
            "name": "dense_18",
            "inbound_nodes": [[["input_layer_6", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_19",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {}
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            },
            "name": "dense_19",
            "inbound_nodes": [[["dense_18", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_20",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {}
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            },
            "name": "dense_20",
            "inbound_nodes": [[["dense_19", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_layer_6", 0, 0]],
        "output_layers": [["dense_20", 0, 0]]
      }
    },
    "training_config": {
      "loss": "mse",
      "optimizer_config": {
        "class_name": "Adam",
        "config": { "learning_rate": 0.001 }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense_18/kernel", "shape": [27, 128], "dtype": "float32" },
        { "name": "dense_18/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_19/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_19/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_20/kernel", "shape": [64, 1], "dtype": "float32" },
        { "name": "dense_20/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
